reports/stage5/wrkLogsGet1.txt
Running 50s test @ http://localhost:8080
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.849ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.05ms  514.49us  12.18ms   69.43%
    Req/Sec   526.51    115.72     0.90k    62.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.03ms
 75.000%    2.38ms
 90.000%    2.70ms
 99.000%    3.28ms
 99.900%    4.12ms
 99.990%    9.01ms
 99.999%   12.18ms
100.000%   12.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.288     0.000000            1         1.00
       1.421     0.100000         4001         1.11
       1.614     0.200000         8011         1.25
       1.764     0.300000        11998         1.43
       1.901     0.400000        15990         1.67
       2.032     0.500000        19995         2.00
       2.097     0.550000        21974         2.22
       2.163     0.600000        24003         2.50
       2.231     0.650000        25968         2.86
       2.305     0.700000        28015         3.33
       2.381     0.750000        29972         4.00
       2.425     0.775000        31002         4.44
       2.471     0.800000        31995         5.00
       2.519     0.825000        32976         5.71
       2.573     0.850000        33990         6.67
       2.635     0.875000        34968         8.00
       2.669     0.887500        35467         8.89
       2.705     0.900000        35959        10.00
       2.747     0.912500        36480        11.43
       2.789     0.925000        36975        13.33
       2.841     0.937500        37459        16.00
       2.871     0.943750        37709        17.78
       2.905     0.950000        37959        20.00
       2.941     0.956250        38207        22.86
       2.975     0.962500        38452        26.67
       3.019     0.968750        38702        32.00
       3.047     0.971875        38833        35.56
       3.073     0.975000        38955        40.00
       3.099     0.978125        39076        45.71
       3.137     0.981250        39201        53.33
       3.181     0.984375        39325        64.00
       3.207     0.985938        39388        71.11
       3.233     0.987500        39451        80.00
       3.261     0.989062        39516        91.43
       3.285     0.990625        39576       106.67
       3.323     0.992188        39637       128.00
       3.345     0.992969        39668       142.22
       3.373     0.993750        39699       160.00
       3.399     0.994531        39730       182.86
       3.439     0.995313        39761       213.33
       3.475     0.996094        39794       256.00
       3.519     0.996484        39808       284.44
       3.559     0.996875        39825       320.00
       3.593     0.997266        39839       365.71
       3.645     0.997656        39856       426.67
       3.695     0.998047        39871       512.00
       3.765     0.998242        39878       568.89
       3.821     0.998437        39886       640.00
       3.939     0.998633        39894       731.43
       4.037     0.998828        39902       853.33
       4.143     0.999023        39909      1024.00
       4.299     0.999121        39913      1137.78
       4.399     0.999219        39917      1280.00
       4.595     0.999316        39921      1462.86
       4.763     0.999414        39925      1706.67
       5.059     0.999512        39929      2048.00
       5.499     0.999561        39931      2275.56
       5.847     0.999609        39933      2560.00
       5.895     0.999658        39935      2925.71
       6.219     0.999707        39937      3413.33
       6.519     0.999756        39939      4096.00
       6.863     0.999780        39940      4551.11
       7.447     0.999805        39941      5120.00
       7.939     0.999829        39942      5851.43
       8.231     0.999854        39943      6826.67
       9.007     0.999878        39944      8192.00
       9.007     0.999890        39944      9102.22
       9.031     0.999902        39945     10240.00
       9.031     0.999915        39945     11702.86
      10.199     0.999927        39946     13653.33
      10.199     0.999939        39946     16384.00
      10.199     0.999945        39946     18204.44
      10.911     0.999951        39947     20480.00
      10.911     0.999957        39947     23405.71
      10.911     0.999963        39947     27306.67
      10.911     0.999969        39947     32768.00
      10.911     0.999973        39947     36408.89
      12.183     0.999976        39948     40960.00
      12.183     1.000000        39948          inf
#[Mean    =        2.053, StdDeviation   =        0.514]
#[Max     =       12.176, Total count    =        39948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.28ms
 75.000%    1.48ms
 90.000%    1.67ms
 99.000%    2.15ms
 99.900%    3.54ms
 99.990%    7.37ms
 99.999%   10.36ms
100.000%   10.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.249     0.000000            1         1.00
       0.949     0.100000         4005         1.11
       1.055     0.200000         8010         1.25
       1.140     0.300000        12022         1.43
       1.213     0.400000        16023         1.67
       1.284     0.500000        19993         2.00
       1.321     0.550000        21979         2.22
       1.359     0.600000        23980         2.50
       1.399     0.650000        26024         2.86
       1.438     0.700000        27987         3.33
       1.483     0.750000        29985         4.00
       1.509     0.775000        30980         4.44
       1.536     0.800000        31982         5.00
       1.564     0.825000        32961         5.71
       1.595     0.850000        33971         6.67
       1.631     0.875000        34977         8.00
       1.651     0.887500        35470         8.89
       1.675     0.900000        35969        10.00
       1.701     0.912500        36458        11.43
       1.732     0.925000        36962        13.33
       1.769     0.937500        37457        16.00
       1.791     0.943750        37705        17.78
       1.813     0.950000        37952        20.00
       1.840     0.956250        38207        22.86
       1.872     0.962500        38452        26.67
       1.912     0.968750        38702        32.00
       1.935     0.971875        38826        35.56
       1.960     0.975000        38953        40.00
       1.987     0.978125        39078        45.71
       2.024     0.981250        39199        53.33
       2.059     0.984375        39332        64.00
       2.079     0.985938        39388        71.11
       2.105     0.987500        39451        80.00
       2.131     0.989062        39517        91.43
       2.171     0.990625        39576       106.67
       2.217     0.992188        39638       128.00
       2.245     0.992969        39669       142.22
       2.269     0.993750        39701       160.00
       2.299     0.994531        39730       182.86
       2.339     0.995313        39762       213.33
       2.399     0.996094        39792       256.00
       2.437     0.996484        39810       284.44
       2.477     0.996875        39824       320.00
       2.529     0.997266        39839       365.71
       2.591     0.997656        39855       426.67
       2.673     0.998047        39870       512.00
       2.715     0.998242        39878       568.89
       2.955     0.998437        39886       640.00
       3.183     0.998633        39894       731.43
       3.453     0.998828        39902       853.33
       3.553     0.999023        39909      1024.00
       3.639     0.999121        39914      1137.78
       3.703     0.999219        39917      1280.00
       3.755     0.999316        39921      1462.86
       3.907     0.999414        39925      1706.67
       4.199     0.999512        39929      2048.00
       4.343     0.999561        39931      2275.56
       4.483     0.999609        39933      2560.00
       4.787     0.999658        39935      2925.71
       5.347     0.999707        39937      3413.33
       5.659     0.999756        39939      4096.00
       5.783     0.999780        39940      4551.11
       5.847     0.999805        39941      5120.00
       7.015     0.999829        39942      5851.43
       7.299     0.999854        39943      6826.67
       7.371     0.999878        39944      8192.00
       7.371     0.999890        39944      9102.22
       7.663     0.999902        39945     10240.00
       7.663     0.999915        39945     11702.86
       8.615     0.999927        39946     13653.33
       8.615     0.999939        39946     16384.00
       8.615     0.999945        39946     18204.44
       9.695     0.999951        39947     20480.00
       9.695     0.999957        39947     23405.71
       9.695     0.999963        39947     27306.67
       9.695     0.999969        39947     32768.00
       9.695     0.999973        39947     36408.89
      10.359     0.999976        39948     40960.00
      10.359     1.000000        39948          inf
#[Mean    =        1.306, StdDeviation   =        0.326]
#[Max     =       10.352, Total count    =        39948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49986 requests in 50.00s, 5.29MB read
Requests/sec:    999.68
Transfer/sec:    108.36KB